espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_eco5_struct.h
/** Type of out_int_st_ch0 register
 *  Masked interrupt status of TX channel 0
 */
typedef union {
    struct {
        /** out_done_ch0_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DONE_CH0_INT
         */
        uint32_t out_done_ch0_int_st:1;
        /** out_eof_ch0_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_EOF_CH0_INT
         */
        uint32_t out_eof_ch0_int_st:1;
        /** out_dscr_err_ch0_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH0_INT
         */
        uint32_t out_dscr_err_ch0_int_st:1;
        /** out_total_eof_ch0_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH0_INT
         */
        uint32_t out_total_eof_ch0_int_st:1;
        /** outfifo_ovf_ch0_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH0_INT
         */
        uint32_t outfifo_ovf_ch0_int_st:1;
        /** outfifo_udf_ch0_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH0_INT
         */
        uint32_t outfifo_udf_ch0_int_st:1;
        /** out_ahbinf_resp_err_ch0_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH0_INT
         */
        uint32_t out_ahbinf_resp_err_ch0_int_st:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_st_ch0_reg_t;

/** Type of out_int_ena_ch0 register
 *  Interrupt enable bits of TX channel 0
 */
typedef union {
    struct {
        /** out_done_ch0_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DONE_CH0_INT
         */
        uint32_t out_done_ch0_int_ena:1;
        /** out_eof_ch0_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_EOF_CH0_INT
         */
        uint32_t out_eof_ch0_int_ena:1;
        /** out_dscr_err_ch0_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH0_INT
         */
        uint32_t out_dscr_err_ch0_int_ena:1;
        /** out_total_eof_ch0_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH0_INT
         */
        uint32_t out_total_eof_ch0_int_ena:1;
        /** outfifo_ovf_ch0_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH0_INT
         */
        uint32_t outfifo_ovf_ch0_int_ena:1;
        /** outfifo_udf_ch0_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH0_INT
         */
        uint32_t outfifo_udf_ch0_int_ena:1;
        /** out_ahbinf_resp_err_ch0_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH0_INT
         */
        uint32_t out_ahbinf_resp_err_ch0_int_ena:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_ena_ch0_reg_t;

/** Type of out_int_clr_ch0 register
 *  Interrupt clear bits of TX channel 0
 */
typedef union {
    struct {
        /** out_done_ch0_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DONE_CH0_INT
         */
        uint32_t out_done_ch0_int_clr:1;
        /** out_eof_ch0_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_EOF_CH0_INT
         */
        uint32_t out_eof_ch0_int_clr:1;
        /** out_dscr_err_ch0_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH0_INT
         */
        uint32_t out_dscr_err_ch0_int_clr:1;
        /** out_total_eof_ch0_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH0_INT
         */
        uint32_t out_total_eof_ch0_int_clr:1;
        /** outfifo_ovf_ch0_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH0_INT
         */
        uint32_t outfifo_ovf_ch0_int_clr:1;
        /** outfifo_udf_ch0_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH0_INT
         */
        uint32_t outfifo_udf_ch0_int_clr:1;
        /** out_ahbinf_resp_err_ch0_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH0_INT
         */
        uint32_t out_ahbinf_resp_err_ch0_int_clr:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_clr_ch0_reg_t;

/** Type of out_int_raw_ch1 register
 *  //Raw interrupt status of TX channel 1
 */
typedef union {
    struct {
        /** out_done_ch1_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_DONE_CH1_INT
         */
        uint32_t out_done_ch1_int_raw:1;
        /** out_eof_ch1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_EOF_CH1_INT
         */
        uint32_t out_eof_ch1_int_raw:1;
        /** out_dscr_err_ch1_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH1_INT
         */
        uint32_t out_dscr_err_ch1_int_raw:1;
        /** out_total_eof_ch1_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH1_INT
         */
        uint32_t out_total_eof_ch1_int_raw:1;
        /** outfifo_ovf_ch1_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH1_INT
         */
        uint32_t outfifo_ovf_ch1_int_raw:1;
        /** outfifo_udf_ch1_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH1_INT
         */
        uint32_t outfifo_udf_ch1_int_raw:1;
        /** out_ahbinf_resp_err_ch1_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH1_INT
         */
        uint32_t out_ahbinf_resp_err_ch1_int_raw:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_raw_ch1_reg_t;

/** Type of out_int_st_ch1 register
 *  Masked interrupt status of TX channel 1
 */
typedef union {
    struct {
        /** out_done_ch1_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DONE_CH1_INT
         */
        uint32_t out_done_ch1_int_st:1;
        /** out_eof_ch1_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_EOF_CH1_INT
         */
        uint32_t out_eof_ch1_int_st:1;
        /** out_dscr_err_ch1_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH1_INT
         */
        uint32_t out_dscr_err_ch1_int_st:1;
        /** out_total_eof_ch1_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH1_INT
         */
        uint32_t out_total_eof_ch1_int_st:1;
        /** outfifo_ovf_ch1_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH1_INT
         */
        uint32_t outfifo_ovf_ch1_int_st:1;
        /** outfifo_udf_ch1_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH1_INT
         */
        uint32_t outfifo_udf_ch1_int_st:1;
        /** out_ahbinf_resp_err_ch1_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH1_INT
         */
        uint32_t out_ahbinf_resp_err_ch1_int_st:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_st_ch1_reg_t;

/** Type of out_int_ena_ch1 register
 *  Interrupt enable bits of TX channel 1
 */
typedef union {
    struct {
        /** out_done_ch1_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DONE_CH1_INT
         */
        uint32_t out_done_ch1_int_ena:1;
        /** out_eof_ch1_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_EOF_CH1_INT
         */
        uint32_t out_eof_ch1_int_ena:1;
        /** out_dscr_err_ch1_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH1_INT
         */
        uint32_t out_dscr_err_ch1_int_ena:1;
        /** out_total_eof_ch1_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH1_INT
         */
        uint32_t out_total_eof_ch1_int_ena:1;
        /** outfifo_ovf_ch1_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH1_INT
         */
        uint32_t outfifo_ovf_ch1_int_ena:1;
        /** outfifo_udf_ch1_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH1_INT
         */
        uint32_t outfifo_udf_ch1_int_ena:1;
        /** out_ahbinf_resp_err_ch1_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH1_INT
         */
        uint32_t out_ahbinf_resp_err_ch1_int_ena:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_ena_ch1_reg_t;

/** Type of out_int_clr_ch1 register
 *  Interrupt clear bits of TX channel 1
 */
typedef union {
    struct {
        /** out_done_ch1_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DONE_CH1_INT
         */
        uint32_t out_done_ch1_int_clr:1;
        /** out_eof_ch1_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_EOF_CH1_INT
         */
        uint32_t out_eof_ch1_int_clr:1;
        /** out_dscr_err_ch1_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH1_INT
         */
        uint32_t out_dscr_err_ch1_int_clr:1;
        /** out_total_eof_ch1_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH1_INT
         */
        uint32_t out_total_eof_ch1_int_clr:1;
        /** outfifo_ovf_ch1_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH1_INT
         */
        uint32_t outfifo_ovf_ch1_int_clr:1;
        /** outfifo_udf_ch1_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH1_INT
         */
        uint32_t outfifo_udf_ch1_int_clr:1;
        /** out_ahbinf_resp_err_ch1_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH1_INT
         */
        uint32_t out_ahbinf_resp_err_ch1_int_clr:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_clr_ch1_reg_t;

