espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_eco5_struct.h
/** Type of in_link_ch1 register
 *  Receive FIFO status of RX channel 1
 */
typedef union {
    struct {
        /** inlink_auto_ret_ch1 : R/W; bitpos: [0]; default: 1;
         *  Configures whether to return to current receive descriptor's address when there are
         *  some errors in current receiving data.
         *  0: Not return
         *  1: Return
         *  .
         */
        uint32_t inlink_auto_ret_ch1:1;
        /** inlink_stop_ch1 : WT; bitpos: [1]; default: 0;
         *  Configures whether to stop AHB_DMA's RX channel 1 from receiving data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t inlink_stop_ch1:1;
        /** inlink_start_ch1 : WT; bitpos: [2]; default: 0;
         *  Configures whether to enable AHB_DMA's RX channel 1 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t inlink_start_ch1:1;
        /** inlink_restart_ch1 : WT; bitpos: [3]; default: 0;
         *  Configures whether to restart RX channel 1 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t inlink_restart_ch1:1;
        /** inlink_park_ch1 : RO; bitpos: [4]; default: 1;
         *  Represents the status of the receive descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t inlink_park_ch1:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} ahb_dma_in_link_ch1_reg_t;

/** Type of in_state_ch1 register
 *  Receive status of RX channel 1
 */
typedef union {
    struct {
        /** inlink_dscr_addr_ch1 : RO; bitpos: [17:0]; default: 0;
         *  reserved
         */
        uint32_t inlink_dscr_addr_ch1:18;
        /** in_dscr_state_ch1 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_ch1:2;
        /** in_state_ch1 : RO; bitpos: [22:20]; default: 0;
         *  Represents the address of the lower 18 bits of the next receive descriptor to be
         *  processed.
         */
        uint32_t in_state_ch1:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_in_state_ch1_reg_t;

/** Type of in_suc_eof_des_addr_ch1 register
 *  Receive descriptor address when EOF occurs on RX channel 1
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_suc_eof_des_addr_ch1_reg_t;

/** Type of in_err_eof_des_addr_ch1 register
 *  Receive descriptor address when errors occur of RX channel 1
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when there are some errors in the
         *  currently received data.
         */
        uint32_t in_err_eof_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_err_eof_des_addr_ch1_reg_t;

/** Type of in_dscr_ch1 register
 *  Current receive descriptor address of RX channel 1
 */
typedef union {
    struct {
        /** inlink_dscr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next receive descriptor x+1 pointed by the current
         *  receive descriptor that has already been fetched.
         */
        uint32_t inlink_dscr_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_ch1_reg_t;

/** Type of in_dscr_bf0_ch1 register
 *  The last receive descriptor address of RX channel 1
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current receive descriptor x that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf0_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf0_ch1_reg_t;

/** Type of in_dscr_bf1_ch1 register
 *  The second-to-last receive descriptor address of RX channel 1
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous receive descriptor x-1 that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf1_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf1_ch1_reg_t;

/** Type of in_peri_ch1 register
 *  Priority register of RX channel 1
 */
typedef union {
    struct {
        /** rx_pri_ch1 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of RX channel 1.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t rx_pri_ch1:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_in_peri_ch1_reg_t;

/** Type of in_peri_sel_ch1 register
 *  Peripheral selection register of RX channel 1
 */
typedef union {
    struct {
        /** peri_in_sel_ch1 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to RX channel 1.
         *  0: I3C
         *  1: Dummy
         *  2: UHCI0
         *  3: I2S0
         *  4: I2S1
         *  5: I2S2
         *  6: Dummy
         *  7: Dummy
         *  8: ADC_DAC
         *  9: Dummy
         *  10: RMT
         *  11~15: Dummy
         */
        uint32_t peri_in_sel_ch1:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_in_peri_sel_ch1_reg_t;

/** Type of out_conf0_ch1 register
 *  Configuration register 0 of TX channel 1
 */
typedef union {
    struct {
        /** out_rst_ch1 : R/W; bitpos: [0]; default: 0;
         *  Configures the reset state of AHB_DMA channel 1 TX FSM and TX FIFO pointer.
         *  0: Release reset
         *  1: Reset
         */
        uint32_t out_rst_ch1:1;
        /** out_loop_test_ch1 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_ch1:1;
        /** out_auto_wrback_ch1 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable automatic outlink write-back when all the data in TX
         *  FIFO has been transmitted.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_auto_wrback_ch1:1;
        /** out_eof_mode_ch1 : R/W; bitpos: [3]; default: 1;
         *  Configures when to generate EOF flag.
         *  0: EOF flag for TX channel 1 is generated when data to be transmitted has been
         *  pushed into FIFO in AHB_DMA.
         *  1: EOF flag for TX channel 1 is generated when data to be transmitted has been
         *  popped from FIFO in AHB_DMA.
         */
        uint32_t out_eof_mode_ch1:1;
        /** outdscr_burst_en_ch1 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable INCR burst transfer for TX channel 1 reading
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outdscr_burst_en_ch1:1;
        /** out_data_burst_en_ch1 : R/W; bitpos: [5]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 1 transmitting data
         *  when accessing internal SRAM.
         */
        uint32_t out_data_burst_en_ch1:1;
        /** out_etm_en_ch1 : R/W; bitpos: [6]; default: 0;
         *  Configures whether to enable ETM control for TX channel 1.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_etm_en_ch1:1;
        uint32_t reserved_7:1;
        /** out_data_burst_mode_sel_ch1 : R/W; bitpos: [9:8]; default: 1;
         *  Configures max burst size for TX channel1.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t out_data_burst_mode_sel_ch1:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_conf0_ch1_reg_t;

/** Type of out_conf1_ch1 register
 *  Configuration register 1 of TX channel 1
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** out_check_owner_ch1 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for TX channel 1.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_check_owner_ch1:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_out_conf1_ch1_reg_t;

