espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_eco5_struct.h
/** Type of outfifo_status_ch1 register
 *  Receive FIFO status of RX channel 1
 */
typedef union {
    struct {
        /** outfifo_full_ch1 : RO; bitpos: [0]; default: 0;
         *  Represents whether L1 TX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t outfifo_full_ch1:1;
        /** outfifo_empty_ch1 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 TX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t outfifo_empty_ch1:1;
        uint32_t reserved_2:6;
        /** outfifo_cnt_ch1 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 TX FIFO for TX channel 1
         */
        uint32_t outfifo_cnt_ch1:7;
        uint32_t reserved_15:8;
        /** out_remain_under_1b_ch1 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_ch1:1;
        /** out_remain_under_2b_ch1 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_ch1:1;
        /** out_remain_under_3b_ch1 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_ch1:1;
        /** out_remain_under_4b_ch1 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_ch1:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} ahb_dma_outfifo_status_ch1_reg_t;

/** Type of out_push_ch1 register
 *  Push control register of TX channel 1
 */
typedef union {
    struct {
        /** outfifo_wdata_ch1 : R/W; bitpos: [8:0]; default: 0;
         *  Configures whether to push data into AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Push
         */
        uint32_t outfifo_wdata_ch1:9;
        /** outfifo_push_ch1 : WT; bitpos: [9]; default: 0;
         *  Configures the data that need to be pushed into AHB_DMA FIFO.
         */
        uint32_t outfifo_push_ch1:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_push_ch1_reg_t;

/** Type of out_link_ch1 register
 *  Push control register of TX channel 1
 */
typedef union {
    struct {
        /** outlink_stop_ch1 : WT; bitpos: [0]; default: 0;
         *  Configures whether to stop AHB_DMA's TX channel 1 from transmitting data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t outlink_stop_ch1:1;
        /** outlink_start_ch1 : WT; bitpos: [1]; default: 0;
         *  Configures whether to enable AHB_DMA's TX channel 1 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outlink_start_ch1:1;
        /** outlink_restart_ch1 : WT; bitpos: [2]; default: 0;
         *  Configures whether to restart TX channel 1 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t outlink_restart_ch1:1;
        /** outlink_park_ch1 : RO; bitpos: [3]; default: 1;
         *  Represents the status of the transmit descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t outlink_park_ch1:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_link_ch1_reg_t;

/** Type of out_state_ch1 register
 *  Transmit status of TX channel 1
 */
typedef union {
    struct {
        /** outlink_dscr_addr_ch1 : RO; bitpos: [17:0]; default: 0;
         *  Represents the lower 18 bits of the address of the next transmit descriptor to be
         *  processed.
         */
        uint32_t outlink_dscr_addr_ch1:18;
        /** out_dscr_state_ch1 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_ch1:2;
        /** out_state_ch1 : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_ch1:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_out_state_ch1_reg_t;

/** Type of out_eof_des_addr_ch1 register
 *  Transmit descriptor address when EOF occurs on TX channel 1
 */
typedef union {
    struct {
        /** out_eof_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_eof_des_addr_ch1_reg_t;

/** Type of out_eof_bfr_des_addr_ch1 register
 *  The last transmit descriptor address when EOF occurs on TX channel 1
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor before the last transmit
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_eof_bfr_des_addr_ch1_reg_t;

/** Type of out_dscr_ch1 register
 *  Current transmit descriptor address of TX channel 1
 */
typedef union {
    struct {
        /** outlink_dscr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next transmit descriptor y+1 pointed by the current
         *  transmit descriptor that has already been fetched.
         */
        uint32_t outlink_dscr_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_ch1_reg_t;

/** Type of out_dscr_bf0_ch1 register
 *  The last transmit descriptor address of TX channel 1
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current transmit descriptor y that has already been
         *  fetched.
         */
        uint32_t outlink_dscr_bf0_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf0_ch1_reg_t;

/** Type of out_dscr_bf1_ch1 register
 *  The second-to-last transmit descriptor address of TX channel 1
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous transmit descriptor y-1 that has already
         *  been fetched.
         */
        uint32_t outlink_dscr_bf1_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf1_ch1_reg_t;

/** Type of out_peri_ch1 register
 *  Priority register of TX channel 1
 */
typedef union {
    struct {
        /** tx_pri_ch1 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of TX channel 1.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t tx_pri_ch1:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_peri_ch1_reg_t;

/** Type of out_peri_sel_ch1 register
 *  Peripheral selection register of TX channel 1
 */
typedef union {
    struct {
        /** peri_out_sel_ch1 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to TX channel 1.
         *  0: I3C
         *  1: Dummy
         *  2: UHCI0
         *  3: I2S0
         *  4: I2S1
         *  5: I2S2
         *  6: Dummy
         *  7: Dummy
         *  8: ADC_DAC
         *  9: Dummy
         *  10: RMT
         *  11~15: Dummy
         */
        uint32_t peri_out_sel_ch1:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_out_peri_sel_ch1_reg_t;

/** Type of in_conf0_ch2 register
 *  Configuration register 0 of RX channel 2
 */
typedef union {
    struct {
        /** in_rst_ch2 : R/W; bitpos: [0]; default: 0;
         *  Write 1 and then 0 to reset AHB_DMA channel 2 RX FSM and RX FIFO pointer.
         */
        uint32_t in_rst_ch2:1;
        /** in_loop_test_ch2 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_ch2:1;
        /** indscr_burst_en_ch2 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable INCR burst transfer for RX channel 2 to read
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t indscr_burst_en_ch2:1;
        /** in_data_burst_en_ch2 : R/W; bitpos: [3]; default: 0;
         *  Set this bit to 1 to enable INCR4 burst transfer for Rx channel 2 receiving data
         *  when accessing internal SRAM.
         */
        uint32_t in_data_burst_en_ch2:1;
        /** mem_trans_en_ch2 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable memory-to-memory data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t mem_trans_en_ch2:1;
        /** in_etm_en_ch2 : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable ETM control for RX channel2.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_etm_en_ch2:1;
        /** in_data_burst_mode_sel_ch2 : R/W; bitpos: [7:6]; default: 1;
         *  Configures max burst size for Rx channel2.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t in_data_burst_mode_sel_ch2:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_conf0_ch2_reg_t;

/** Type of in_conf1_ch2 register
 *  Configuration register 1 of RX channel 2
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** in_check_owner_ch2 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for RX channel 2.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_check_owner_ch2:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_conf1_ch2_reg_t;

/** Type of infifo_status_ch2 register
 *  Receive FIFO status of RX channel 2
 */
typedef union {
    struct {
        /** infifo_full_ch2 : RO; bitpos: [0]; default: 1;
         *  Represents whether L1 RX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t infifo_full_ch2:1;
        /** infifo_empty_ch2 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 RX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t infifo_empty_ch2:1;
        uint32_t reserved_2:6;
        /** infifo_cnt_ch2 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 RX FIFO for RX channel 2
         */
        uint32_t infifo_cnt_ch2:7;
        uint32_t reserved_15:8;
        /** in_remain_under_1b_ch2 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_1b_ch2:1;
        /** in_remain_under_2b_ch2 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_2b_ch2:1;
        /** in_remain_under_3b_ch2 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_3b_ch2:1;
        /** in_remain_under_4b_ch2 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_4b_ch2:1;
        /** in_buf_hungry_ch2 : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry_ch2:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ahb_dma_infifo_status_ch2_reg_t;

/** Type of in_pop_ch2 register
 *  Receive FIFO status of RX channel 2
 */
typedef union {
    struct {
        /** infifo_rdata_ch2 : RO; bitpos: [11:0]; default: 2048;
         *  Represents the data popped from AHB_DMA FIFO.
         */
        uint32_t infifo_rdata_ch2:12;
        /** infifo_pop_ch2 : WT; bitpos: [12]; default: 0;
         *  Configures whether to pop data from AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Pop
         */
        uint32_t infifo_pop_ch2:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_pop_ch2_reg_t;

/** Type of in_link_ch2 register
 *  Receive FIFO status of RX channel 2
 */
typedef union {
    struct {
        /** inlink_auto_ret_ch2 : R/W; bitpos: [0]; default: 1;
         *  Configures whether to return to current receive descriptor's address when there are
         *  some errors in current receiving data.
         *  0: Not return
         *  1: Return
         *  .
         */
        uint32_t inlink_auto_ret_ch2:1;
        /** inlink_stop_ch2 : WT; bitpos: [1]; default: 0;
         *  Configures whether to stop AHB_DMA's RX channel 2 from receiving data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t inlink_stop_ch2:1;
        /** inlink_start_ch2 : WT; bitpos: [2]; default: 0;
         *  Configures whether to enable AHB_DMA's RX channel 2 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t inlink_start_ch2:1;
        /** inlink_restart_ch2 : WT; bitpos: [3]; default: 0;
         *  Configures whether to restart RX channel 2 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t inlink_restart_ch2:1;
        /** inlink_park_ch2 : RO; bitpos: [4]; default: 1;
         *  Represents the status of the receive descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t inlink_park_ch2:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} ahb_dma_in_link_ch2_reg_t;

/** Type of in_state_ch2 register
 *  Receive status of RX channel 2
 */
typedef union {
    struct {
        /** inlink_dscr_addr_ch2 : RO; bitpos: [17:0]; default: 0;
         *  reserved
         */
        uint32_t inlink_dscr_addr_ch2:18;
        /** in_dscr_state_ch2 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_ch2:2;
        /** in_state_ch2 : RO; bitpos: [22:20]; default: 0;
         *  Represents the address of the lower 18 bits of the next receive descriptor to be
         *  processed.
         */
        uint32_t in_state_ch2:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_in_state_ch2_reg_t;

