espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_eco5_struct.h
/** Type of tx_arb_weight_opt_dir_ch1 register
 *  TX channel 1 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** tx_arb_weight_opt_dis_ch1 : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t tx_arb_weight_opt_dis_ch1:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_tx_arb_weight_opt_dir_ch1_reg_t;

/** Type of tx_ch_arb_weight_ch2 register
 *  TX channel 2 arbitration weight configuration register
 */
typedef union {
    struct {
        /** tx_arb_weight_value_ch2 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of TX channel2
         */
        uint32_t tx_arb_weight_value_ch2:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_tx_ch_arb_weight_ch2_reg_t;

/** Type of tx_arb_weight_opt_dir_ch2 register
 *  TX channel 2 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** tx_arb_weight_opt_dis_ch2 : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t tx_arb_weight_opt_dis_ch2:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_tx_arb_weight_opt_dir_ch2_reg_t;

/** Type of rx_ch_arb_weight_ch0 register
 *  RX channel 0 arbitration weight configuration register
 */
typedef union {
    struct {
        /** rx_arb_weight_value_ch0 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of RX channel0
         */
        uint32_t rx_arb_weight_value_ch0:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_rx_ch_arb_weight_ch0_reg_t;

/** Type of rx_arb_weight_opt_dir_ch0 register
 *  RX channel 0 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** rx_arb_weight_opt_dis_ch0 : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rx_arb_weight_opt_dis_ch0:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_rx_arb_weight_opt_dir_ch0_reg_t;

/** Type of rx_ch_arb_weight_ch1 register
 *  RX channel 1 arbitration weight configuration register
 */
typedef union {
    struct {
        /** rx_arb_weight_value_ch1 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of RX channel1
         */
        uint32_t rx_arb_weight_value_ch1:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_rx_ch_arb_weight_ch1_reg_t;

/** Type of rx_arb_weight_opt_dir_ch1 register
 *  RX channel 1 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** rx_arb_weight_opt_dis_ch1 : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rx_arb_weight_opt_dis_ch1:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_rx_arb_weight_opt_dir_ch1_reg_t;

/** Type of in_link_addr_ch0 register
 *  Link list descriptor address configuration of RX channel 0
 */
typedef union {
    struct {
        /** inlink_addr_ch0 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address
         */
        uint32_t inlink_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_link_addr_ch0_reg_t;

/** Type of in_link_addr_ch1 register
 *  Link list descriptor address configuration of RX channel 1
 */
typedef union {
    struct {
        /** inlink_addr_ch1 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address
         */
        uint32_t inlink_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_link_addr_ch1_reg_t;

/** Type of in_link_addr_ch2 register
 *  Link list descriptor address configuration of RX channel 2
 */
typedef union {
    struct {
        /** inlink_addr_ch2 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address
         */
        uint32_t inlink_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_link_addr_ch2_reg_t;

/** Type of out_link_addr_ch0 register
 *  Link list descriptor address configuration of TX channel 0
 */
typedef union {
    struct {
        /** outlink_addr_ch0 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address.
         */
        uint32_t outlink_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_link_addr_ch0_reg_t;

/** Type of out_link_addr_ch1 register
 *  Link list descriptor address configuration of TX channel 1
 */
typedef union {
    struct {
        /** outlink_addr_ch1 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address.
         */
        uint32_t outlink_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_link_addr_ch1_reg_t;

/** Type of out_link_addr_ch2 register
 *  Link list descriptor address configuration of TX channel 2
 */
typedef union {
    struct {
        /** outlink_addr_ch2 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 32 bits of the first receive descriptor's address.
         */
        uint32_t outlink_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_link_addr_ch2_reg_t;

/** Type of intr_mem_start_addr register
 *  Accessible address space start address configuration register
 */
typedef union {
    struct {
        /** access_intr_mem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  Accessible address space start address configuration register
         */
        uint32_t access_intr_mem_start_addr:32;
    };
    uint32_t val;
} ahb_dma_intr_mem_start_addr_reg_t;

/** Type of intr_mem_end_addr register
 *  Accessible address space end address configuration register
 */
typedef union {
    struct {
        /** access_intr_mem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  Configures the end address of accessible address space.
         */
        uint32_t access_intr_mem_end_addr:32;
    };
    uint32_t val;
} ahb_dma_intr_mem_end_addr_reg_t;

