espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ahb_dma_eco5_struct.h
/** Type of arb_timeout register
 *  TX arbitration timeout configuration register
 */
typedef union {
    struct {
        /** arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Configures the time slot. Measurement unit: AHB bus clock cycle.
         */
        uint32_t arb_timeout_num:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} ahb_dma_arb_timeout_reg_t;

/** Type of weight_en register
 *  TX weight arbitration enable register
 */
typedef union {
    struct {
        /** weight_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable weight arbitration.
         *  0: Disable
         *  1: Enable
         */
        uint32_t weight_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_weight_en_reg_t;

/** Type of module_clk_en register
 *  Module clock force on register
 */
typedef union {
    struct {
        /** ahb_apb_sync_clk_en : R/W; bitpos: [2:0]; default: 7;
         *  Configures whether to force on ahb_apb_sync 2~0 module clock. For bit n:
         *  0 : Not force on ahb_apb_sync n clock
         *  1 : Force on ahb_apb_sync n clock
         */
        uint32_t ahb_apb_sync_clk_en:3;
        /** out_dscr_clk_en : R/W; bitpos: [5:3]; default: 7;
         *  Configures whether to force on out_dscr 2~0 module clock. For bit n:
         *  0 : Not force on out_dscr n clock
         *  1 : Force on out_dscr n clock
         */
        uint32_t out_dscr_clk_en:3;
        /** out_ctrl_clk_en : R/W; bitpos: [8:6]; default: 7;
         *  Configures whether to force on out_ctrl 2~0 module clock. For bit n:
         *  0 : Not force on out_ctrl n clock
         *  1 : Force on out_ctrl n clock
         */
        uint32_t out_ctrl_clk_en:3;
        /** in_dscr_clk_en : R/W; bitpos: [11:9]; default: 7;
         *  Configures whether to force on in_dscr 2~0 module clock. For bit n:
         *  0 : Not force on in_dscr n clock
         *  1 : Force on in_dscr n clock
         */
        uint32_t in_dscr_clk_en:3;
        /** in_ctrl_clk_en : R/W; bitpos: [14:12]; default: 7;
         *  Configures whether to force on in_ctrl 2~0 module clock. For bit n:
         *  0 : Not force on in_ctrl n clock
         *  1 : Force on in_ctrl n clock
         */
        uint32_t in_ctrl_clk_en:3;
        uint32_t reserved_15:12;
        /** cmd_arb_clk_en : R/W; bitpos: [27]; default: 0;
         *  Configures whether to force on cmd_arb module clock.
         *  0 : Not force on cmd_arb clock
         *  1 : Force on cmd_arb clock
         */
        uint32_t cmd_arb_clk_en:1;
        /** ahbinf_clk_en : R/W; bitpos: [28]; default: 0;
         *  Configures whether to force on ahbinf module clock.
         *  0 : Not force on ahbinf clock
         *  1 : Force on ahbinf clock
         */
        uint32_t ahbinf_clk_en:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} ahb_dma_module_clk_en_reg_t;

/** Type of ahbinf_resp_err_status0 register
 *  AHB response error status 0 register
 */
typedef union {
    struct {
        /** ahbinf_resp_err_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the AHB response error.
         */
        uint32_t ahbinf_resp_err_addr:32;
    };
    uint32_t val;
} ahb_dma_ahbinf_resp_err_status0_reg_t;

/** Type of ahbinf_resp_err_status1 register
 *  AHB response error status 1 register
 */
typedef union {
    struct {
        /** ahbinf_resp_err_wr : RO; bitpos: [0]; default: 0;
         *  Represents the AHB response error is write request.
         */
        uint32_t ahbinf_resp_err_wr:1;
        /** ahbinf_resp_err_id : RO; bitpos: [4:1]; default: 15;
         *  Represents the AHB response error request id.
         */
        uint32_t ahbinf_resp_err_id:4;
        /** ahbinf_resp_err_ch_id : RO; bitpos: [7:5]; default: 0;
         *  Represents the AHB response error request channel id.bit[2]=1:TX channel.
         *  bit[2]=0:RX channel.
         */
        uint32_t ahbinf_resp_err_ch_id:3;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_ahbinf_resp_err_status1_reg_t;

/** Type of in_done_des_addr_ch0 register
 *  RX_done Inlink descriptor address of RX channel 0
 */
typedef union {
    struct {
        /** in_done_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the inlink descriptor when  this descriptor is completed .
         */
        uint32_t in_done_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_done_des_addr_ch0_reg_t;

/** Type of out_done_des_addr_ch0 register
 *  TX done outlink descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** out_done_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the outlink descriptor when this descriptor is completed.
         */
        uint32_t out_done_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_done_des_addr_ch0_reg_t;

/** Type of in_done_des_addr_ch1 register
 *  RX_done Inlink descriptor address of RX channel 1
 */
typedef union {
    struct {
        /** in_done_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the inlink descriptor when  this descriptor is completed .
         */
        uint32_t in_done_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_in_done_des_addr_ch1_reg_t;

/** Type of out_done_des_addr_ch1 register
 *  TX done outlink descriptor address of TX channel 1
 */
typedef union {
    struct {
        /** out_done_des_addr_ch1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the outlink descriptor when this descriptor is completed.
         */
        uint32_t out_done_des_addr_ch1:32;
    };
    uint32_t val;
} ahb_dma_out_done_des_addr_ch1_reg_t;

/** Type of in_done_des_addr_ch2 register
 *  RX_done Inlink descriptor address of RX channel 2
 */
typedef union {
    struct {
        /** in_done_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the inlink descriptor when  this descriptor is completed .
         */
        uint32_t in_done_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_done_des_addr_ch2_reg_t;

/** Type of out_done_des_addr_ch2 register
 *  TX done outlink descriptor address of TX channel 2
 */
typedef union {
    struct {
        /** out_done_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the outlink descriptor when this descriptor is completed.
         */
        uint32_t out_done_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_done_des_addr_ch2_reg_t;


